# Operations on Text Data
* pandas has powerful inbuilt methods to perform operations on text data

In [1]:
# import numpy & pandas libraries
import numpy as np
import pandas as pd

In [3]:
companies = pd.read_excel("C:/Users/user/Documents/GitHub/AI-ML-Algorithms-for-Business-Applications/Operations on Data/02 Pandas/text_data_file.xlsx")

In [5]:
# check the companies
companies.head()

,Company Name,Beta,Alpha,NIFTY closing,Date,sak
0,20 Microns Ltd.,1.23,-0.08,17416.55,2021-11-22,q
1,20Th Century Finance Corpn. Ltd. [Merged],0.61,-0.61,1160.15,1999-05-18,qeur
2,3I Infotech Ltd.,1.49,0.18,17416.55,2021-11-22,kas
3,3M India Ltd.,0.90,0.21,17416.55,2021-11-22,NaN
4,3P Land Holdings Ltd.,0.92,0.09,17416.55,2021-11-22,jhs

In [6]:
# other way to inspect the columns, or particular column is given below:
# .values converts the pandas column into an array
companies['Company Name'].head().values

array(['20 Microns Ltd.', '20Th Century Finance Corpn. Ltd. [Merged]',
       '3I Infotech Ltd.', '3M India Ltd.', '3P Land Holdings Ltd.'],
      dtype=object)

# Challenges:
* Clean the values in columns for consistency for further analysis
* use suite of Pthyon and Pandas methods to achieve the same

In [8]:
# str has suite of attribute & methods to work on strings
# companies['Company Name'] is a pandas string column and accessed using StringMethods
companies['Company Name'].str

In [9]:
# Strip 
# * strip is in-built Python function
# * strip removes leading as well as trailing characters in a string

# Illustration of strip

str1 = "   Hello, Welcome!     "
str1.strip()

'Hello, Welcome!'

In [13]:
str1 = "ew   Hello, Welcome!     we"
str2 = "e"
str1.strip(str2)

'w   Hello, Welcome!     w'

In [15]:
str1 = "dew   Hello, Welcome!     wed"
str2 = "edw"
str1.strip(str2)

'   Hello, Welcome!     '

In [18]:
# Left strip: strips the spaces or strings at left side
str1 = "   Hello, Welcome!     "
str1.lstrip()

'Hello, Welcome!     '

In [20]:
# Left strip: strips the strings at left side
str1 = "dew   Hello, Welcome!     wed"
str2 = "edw"
str1.lstrip(str2)

'   Hello, Welcome!     wed'

In [19]:
#Right strip the spaces or strings at right side
str1 = "   Hello, Welcome!     "
str1.rstrip()

'   Hello, Welcome!'

In [21]:
# Left strip: strips the strings at right side
str1 = "dew   Hello, Welcome!     wed"
str2 = "edw"
str1.rstrip(str2)

'dew   Hello, Welcome!     '

In [22]:
# lower() or upper() cases for the strings
str1 = "   Hello, Welcome!     "
print("str1 :", str1)
print("str1 lower :", str1.lower())
print("str1 UPPER :", str1.upper())

str1 :    Hello, Welcome!
str1 lower :    hello, welcome!
str1 UPPER :    HELLO, WELCOME!

In [64]:
# Perform upper, lower & stripping in a data frame
str_df = pd.DataFrame({"greeting": ["  hello  ", "  welcome!"], "place" : ["  pilani", "hyderabad    "], 
"campus" : ["   bits Pilani   ", "BIts hYderabad     "] , "state  " : ["rajasthan   ", "    telangana"] }
)
str_df

     greeting          place               campus        state
0     hello           pilani       bits Pilani      rajasthan
1    welcome!  hyderabad      BIts hYderabad           telangana

In [65]:
str_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   greeting  2 non-null      object
 1   place     2 non-null      object
 2   campus    2 non-null      object
 3   state     2 non-null      object
dtypes: object(4)
memory usage: 192.0+ bytes

In [54]:
str_df['greeting'].str.strip()

0       hello
1    welcome!
Name: greeting, dtype: object

In [61]:
str_df['place'].str.upper()

0           PILANI
1    HYDERABAD
Name: place, dtype: object

In [60]:
str_df['place'].str.len()

0     8
1    13
Name: place, dtype: int64

In [62]:
# Verify the stripping
str_df['greeting'] = str_df['greeting'].str.strip()
str_df['greeting'].str.len()

0    5
1    8
Name: greeting, dtype: int64

In [63]:
# Capitalise greetings
str_df['greeting'] = str_df['greeting'].str.capitalize()
str_df['greeting']

0       Hello
1    Welcome!
Name: greeting, dtype: object

In [66]:
# capitalise first letter of each word
str_df['campus'].str.title()

0         Bits Pilani
1    Bits Hyderabad
Name: campus, dtype: object

# Slicing the strings
* Slicing is powerful technique to extract certain components in a string from the position of string

In [68]:
# Create students_df dataframe that constitutes column names:
# Students, Group, Gender, Scores
students_df = pd.DataFrame(
 {
 "Students": [
 "Rohit, Mr. Rohit",
 "Jyothula, Mr. Sougandh",
 "Mary, Miss. Sajitha",
 "J, Miss. Nehal",
 "Vaibhav, Mr. Vaibhav",
 "Priyanka, Miss. Mira",
 ],
"Group": [ "p2", "P2", "P2", "P1", "p2", "p1"],
"Gender" : ["M", "male", "female", "F", "Male", "Female"],
"Scores" : [8, 9, 7, 7, 8, 8],
"Rank"   : ["Rank 2", "rank 1", "rank 5", "Rank 5", "rank 2", "Rank 2" ]
 }
)

students_df

                 Students Group  Gender  Scores    Rank
0        Rohit, Mr. Rohit    p2       M       8  Rank 2
1  Jyothula, Mr. Sougandh    P2    male       9  rank 1
2     Mary, Miss. Sajitha    P2  female       7  rank 5
3          J, Miss. Nehal    P1       F       7  Rank 5
4    Vaibhav, Mr. Vaibhav    p2    Male       8  rank 2
5    Priyanka, Miss. Mira    p1  Female       8  Rank 2

In [73]:
# Fetch the unique ranks
#review student rank column
print(students_df['Rank'])

# fetch unique values of ranks using unique()
students_df['Rank'].unique()

0    Rank 2
1    rank 1
2    rank 5
3    Rank 5
4    rank 2
5    Rank 2
Name: Rank, dtype: object

array(['Rank 2', 'rank 1', 'rank 5', 'Rank 5', 'rank 2'], dtype=object)

## Lab exercise
* convert all values in Rank column to consistent format
* hint: without using slicing

## using slicing convert all values in Rank column to consistent format
* use Pythonâ€™s list-slicing syntax
* use .str.slice(postion_from, position_to)
* use replace()
* illustration given below

In [74]:
students_df['Rank']

0    Rank 2
1    rank 1
2    rank 5
3    Rank 5
4    rank 2
5    Rank 2
Name: Rank, dtype: object

In [76]:
# use str.slice(position_from, position_to) on the data frame column
students_df['Rank'].str.slice(5,6)

0    2
1    1
2    5
3    5
4    2
5    2
Name: Rank, dtype: object

In [77]:
#  Slicing using Python's list slicing syntax
students_df['Rank'].str[4:]

0     2
1     1
2     5
3     5
4     2
5     2
Name: Rank, dtype: object

In [82]:
#  Slicing using Python's list slicing syntax
# fora Rank1
students_df['Rank'].replace(to_replace = ["rank 1", "rank 5", "rank 2"], value = ["Rank 1", "Rank 5", "Rank 2"] )

0    Rank 2
1    Rank 1
2    Rank 5
3    Rank 5
4    Rank 2
5    Rank 2
Name: Rank, dtype: object

In [83]:
## Boolean Methods in Strings

"BITS" in "Welcome to BITS Pilani"

True

In [84]:
"Bits" in "Welcome to BITS Pilani"

False

In [86]:
"Bits".upper() in "Welcome to BITS Pilani"

True

### Lab Exercise
* Search for company starting with "A B C" in companies data frame
* hints: use lower() or upper()
* hints: use str.contains("string_name) or str.startswith("string_name) or str.endswith("string_name)

## Splitting Strings
* use str.split()
* creates array of split values

In [91]:
# split by space
"Welcome to BITS Pilani!".split(" ")

['Welcome', 'to', 'BITS', 'Pilani!']

In [92]:
# split by a special character
"11-22-33-44-555-6666-88".split("-")

['11', '22', '33', '44', '555', '6666', '88']

In [98]:
# split by patternw when you identify pattern such as a special character (space)
students_df['Rank'].str.split(pat = " ")

0    [Rank, 2]
1    [rank, 1]
2    [rank, 5]
3    [Rank, 5]
4    [rank, 2]
5    [Rank, 2]
Name: Rank, dtype: object

In [90]:
# the above cell is equivalent to the below line of code
students_df['Rank'].str.split(" ")

0    [Rank, 2]
1    [rank, 1]
2    [rank, 5]
3    [Rank, 5]
4    [rank, 2]
5    [Rank, 2]
Name: Rank, dtype: object

In [102]:
# limiting maximum number of splits with n argument
# convert to data frame using expand = True
students_df['Students'].str.split(" ", n=1, expand = True)

           0              1
0     Rohit,      Mr. Rohit
1  Jyothula,   Mr. Sougandh
2      Mary,  Miss. Sajitha
3         J,    Miss. Nehal
4   Vaibhav,    Mr. Vaibhav
5  Priyanka,     Miss. Mira